04_tests/stress/results/performance-2026-09-02/monolith/flight-search-run2-k6.stdout.log

         /\      Grafana   /‾‾/
    /\  /  \     |\  __   /  /
   /  \/    \    | |/ /  /   ‾‾\
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/


     execution: local
        script: D:\Campus\grade2\26Spring\Software_engineering\04_tests\stress\flight-search.js
        output: -

     scenarios: (100.00%) 1 scenario, 50 max VUs, 2m25s max duration (incl. graceful stop):
              * flight_search: Up to 50 looping VUs for 2m15s over 5 stages (gracefulRampDown: 10s, gracefulStop: 30s)


running (0m01.0s), 01/50 VUs, 1 complete and 0 interrupted iterations
flight_search   [   1% ] 01/50 VUs  0m01.0s/2m15.0s

running (0m02.0s), 01/50 VUs, 3 complete and 0 interrupted iterations
flight_search   [   1% ] 01/50 VUs  0m02.0s/2m15.0s

running (0m03.0s), 01/50 VUs, 5 complete and 0 interrupted iterations
flight_search   [   2% ] 01/50 VUs  0m03.0s/2m15.0s

running (0m04.0s), 01/50 VUs, 7 complete and 0 interrupted iterations
flight_search   [   3% ] 01/50 VUs  0m04.0s/2m15.0s

running (0m05.0s), 01/50 VUs, 9 complete and 0 interrupted iterations
flight_search   [   4% ] 01/50 VUs  0m05.0s/2m15.0s

running (0m06.0s), 01/50 VUs, 11 complete and 0 interrupted iterations
flight_search   [   4% ] 01/50 VUs  0m06.0s/2m15.0s

running (0m07.0s), 01/50 VUs, 13 complete and 0 interrupted iterations
flight_search   [   5% ] 01/50 VUs  0m07.0s/2m15.0s

running (0m08.0s), 02/50 VUs, 15 complete and 0 interrupted iterations
flight_search   [   6% ] 02/50 VUs  0m08.0s/2m15.0s

running (0m09.0s), 02/50 VUs, 19 complete and 0 interrupted iterations
flight_search   [   7% ] 02/50 VUs  0m09.0s/2m15.0s

running (0m10.0s), 02/50 VUs, 23 complete and 0 interrupted iterations
flight_search   [   7% ] 02/50 VUs  0m10.0s/2m15.0s

running (0m11.0s), 02/50 VUs, 27 complete and 0 interrupted iterations
flight_search   [   8% ] 02/50 VUs  0m11.0s/2m15.0s

running (0m12.0s), 02/50 VUs, 31 complete and 0 interrupted iterations
flight_search   [   9% ] 02/50 VUs  0m12.0s/2m15.0s

running (0m13.0s), 02/50 VUs, 35 complete and 0 interrupted iterations
flight_search   [  10% ] 02/50 VUs  0m13.0s/2m15.0s

running (0m14.0s), 02/50 VUs, 39 complete and 0 interrupted iterations
flight_search   [  10% ] 02/50 VUs  0m14.0s/2m15.0s

running (0m15.0s), 02/50 VUs, 43 complete and 0 interrupted iterations
flight_search   [  11% ] 02/50 VUs  0m15.0s/2m15.0s

running (0m16.0s), 03/50 VUs, 48 complete and 0 interrupted iterations
flight_search   [  12% ] 03/50 VUs  0m16.0s/2m15.0s

running (0m17.0s), 03/50 VUs, 54 complete and 0 interrupted iterations
flight_search   [  13% ] 03/50 VUs  0m17.0s/2m15.0s

running (0m18.0s), 03/50 VUs, 60 complete and 0 interrupted iterations
flight_search   [  13% ] 03/50 VUs  0m18.0s/2m15.0s

running (0m19.0s), 03/50 VUs, 65 complete and 0 interrupted iterations
flight_search   [  14% ] 03/50 VUs  0m19.0s/2m15.0s

running (0m20.0s), 03/50 VUs, 71 complete and 0 interrupted iterations
flight_search   [  15% ] 03/50 VUs  0m20.0s/2m15.0s

running (0m21.0s), 03/50 VUs, 77 complete and 0 interrupted iterations
flight_search   [  16% ] 03/50 VUs  0m21.0s/2m15.0s

running (0m22.0s), 03/50 VUs, 83 complete and 0 interrupted iterations
flight_search   [  16% ] 03/50 VUs  0m22.0s/2m15.0s

running (0m23.0s), 04/50 VUs, 89 complete and 0 interrupted iterations
flight_search   [  17% ] 04/50 VUs  0m23.0s/2m15.0s

running (0m24.0s), 04/50 VUs, 97 complete and 0 interrupted iterations
flight_search   [  18% ] 04/50 VUs  0m24.0s/2m15.0s

running (0m25.0s), 04/50 VUs, 105 complete and 0 interrupted iterations
flight_search   [  19% ] 04/50 VUs  0m25.0s/2m15.0s

running (0m26.0s), 04/50 VUs, 113 complete and 0 interrupted iterations
flight_search   [  19% ] 04/50 VUs  0m26.0s/2m15.0s

running (0m27.0s), 04/50 VUs, 120 complete and 0 interrupted iterations
flight_search   [  20% ] 04/50 VUs  0m27.0s/2m15.0s

running (0m28.0s), 04/50 VUs, 128 complete and 0 interrupted iterations
flight_search   [  21% ] 04/50 VUs  0m28.0s/2m15.0s

running (0m29.0s), 04/50 VUs, 136 complete and 0 interrupted iterations
flight_search   [  21% ] 04/50 VUs  0m29.0s/2m15.0s

running (0m30.0s), 04/50 VUs, 144 complete and 0 interrupted iterations
flight_search   [  22% ] 04/50 VUs  0m30.0s/2m15.0s

running (0m31.0s), 05/50 VUs, 153 complete and 0 interrupted iterations
flight_search   [  23% ] 05/50 VUs  0m31.0s/2m15.0s

running (0m32.0s), 05/50 VUs, 163 complete and 0 interrupted iterations
flight_search   [  24% ] 05/50 VUs  0m32.0s/2m15.0s

running (0m33.0s), 05/50 VUs, 173 complete and 0 interrupted iterations
flight_search   [  24% ] 05/50 VUs  0m33.0s/2m15.0s

running (0m34.0s), 05/50 VUs, 183 complete and 0 interrupted iterations
flight_search   [  25% ] 05/50 VUs  0m34.0s/2m15.0s

running (0m35.0s), 05/50 VUs, 192 complete and 0 interrupted iterations
flight_search   [  26% ] 05/50 VUs  0m35.0s/2m15.0s

running (0m36.0s), 05/50 VUs, 202 complete and 0 interrupted iterations
flight_search   [  27% ] 05/50 VUs  0m36.0s/2m15.0s

running (0m37.0s), 06/50 VUs, 213 complete and 0 interrupted iterations
flight_search   [  27% ] 06/50 VUs  0m37.0s/2m15.0s

running (0m38.0s), 06/50 VUs, 224 complete and 0 interrupted iterations
flight_search   [  28% ] 06/50 VUs  0m38.0s/2m15.0s

running (0m39.0s), 06/50 VUs, 236 complete and 0 interrupted iterations
flight_search   [  29% ] 06/50 VUs  0m39.0s/2m15.0s

running (0m40.0s), 06/50 VUs, 248 complete and 0 interrupted iterations
flight_search   [  30% ] 06/50 VUs  0m40.0s/2m15.0s

running (0m41.0s), 06/50 VUs, 260 complete and 0 interrupted iterations
flight_search   [  30% ] 06/50 VUs  0m41.0s/2m15.0s

running (0m42.0s), 06/50 VUs, 271 complete and 0 interrupted iterations
flight_search   [  31% ] 06/50 VUs  0m42.0s/2m15.0s

running (0m43.0s), 07/50 VUs, 284 complete and 0 interrupted iterations
flight_search   [  32% ] 07/50 VUs  0m43.0s/2m15.0s

running (0m44.0s), 07/50 VUs, 298 complete and 0 interrupted iterations
flight_search   [  33% ] 07/50 VUs  0m44.0s/2m15.0s

running (0m45.0s), 07/50 VUs, 312 complete and 0 interrupted iterations
flight_search   [  33% ] 07/50 VUs  0m45.0s/2m15.0s

running (0m46.0s), 07/50 VUs, 326 complete and 0 interrupted iterations
flight_search   [  34% ] 07/50 VUs  0m46.0s/2m15.0s

running (0m47.0s), 07/50 VUs, 339 complete and 0 interrupted iterations
flight_search   [  35% ] 07/50 VUs  0m47.0s/2m15.0s

running (0m48.0s), 07/50 VUs, 353 complete and 0 interrupted iterations
flight_search   [  36% ] 07/50 VUs  0m48.0s/2m15.0s

running (0m49.0s), 08/50 VUs, 368 complete and 0 interrupted iterations
flight_search   [  36% ] 08/50 VUs  0m49.0s/2m15.0s

running (0m50.0s), 08/50 VUs, 384 complete and 0 interrupted iterations
flight_search   [  37% ] 08/50 VUs  0m50.0s/2m15.0s

running (0m51.0s), 08/50 VUs, 399 complete and 0 interrupted iterations
flight_search   [  38% ] 08/50 VUs  0m51.0s/2m15.0s

running (0m52.0s), 08/50 VUs, 415 complete and 0 interrupted iterations
flight_search   [  39% ] 08/50 VUs  0m52.0s/2m15.0s

running (0m53.0s), 08/50 VUs, 431 complete and 0 interrupted iterations
flight_search   [  39% ] 08/50 VUs  0m53.0s/2m15.0s

running (0m54.0s), 08/50 VUs, 447 complete and 0 interrupted iterations
flight_search   [  40% ] 08/50 VUs  0m54.0s/2m15.0s

running (0m55.0s), 09/50 VUs, 464 complete and 0 interrupted iterations
flight_search   [  41% ] 09/50 VUs  0m55.0s/2m15.0s

running (0m56.0s), 09/50 VUs, 480 complete and 0 interrupted iterations
flight_search   [  41% ] 09/50 VUs  0m56.0s/2m15.0s

running (0m57.0s), 09/50 VUs, 498 complete and 0 interrupted iterations
flight_search   [  42% ] 09/50 VUs  0m57.0s/2m15.0s

running (0m58.0s), 09/50 VUs, 515 complete and 0 interrupted iterations
flight_search   [  43% ] 09/50 VUs  0m58.0s/2m15.0s

running (0m59.0s), 09/50 VUs, 533 complete and 0 interrupted iterations
flight_search   [  44% ] 09/50 VUs  0m59.0s/2m15.0s

running (1m00.0s), 09/50 VUs, 551 complete and 0 interrupted iterations
flight_search   [  44% ] 09/50 VUs  1m00.0s/2m15.0s

running (1m01.0s), 10/50 VUs, 570 complete and 0 interrupted iterations
flight_search   [  45% ] 10/50 VUs  1m01.0s/2m15.0s

running (1m02.0s), 10/50 VUs, 588 complete and 0 interrupted iterations
flight_search   [  46% ] 10/50 VUs  1m02.0s/2m15.0s

running (1m03.0s), 10/50 VUs, 608 complete and 0 interrupted iterations
flight_search   [  47% ] 10/50 VUs  1m03.0s/2m15.0s

running (1m04.0s), 11/50 VUs, 629 complete and 0 interrupted iterations
flight_search   [  47% ] 11/50 VUs  1m04.0s/2m15.0s

running (1m05.0s), 11/50 VUs, 651 complete and 0 interrupted iterations
flight_search   [  48% ] 11/50 VUs  1m05.0s/2m15.0s

running (1m06.0s), 11/50 VUs, 673 complete and 0 interrupted iterations
flight_search   [  49% ] 11/50 VUs  1m06.0s/2m15.0s

running (1m07.0s), 12/50 VUs, 694 complete and 0 interrupted iterations
flight_search   [  50% ] 12/50 VUs  1m07.0s/2m15.0s

running (1m08.0s), 12/50 VUs, 718 complete and 0 interrupted iterations
flight_search   [  50% ] 12/50 VUs  1m08.0s/2m15.0s

running (1m09.0s), 12/50 VUs, 742 complete and 0 interrupted iterations
flight_search   [  51% ] 12/50 VUs  1m09.0s/2m15.0s

running (1m10.0s), 13/50 VUs, 766 complete and 0 interrupted iterations
flight_search   [  52% ] 13/50 VUs  1m10.0s/2m15.0s

running (1m11.0s), 13/50 VUs, 792 complete and 0 interrupted iterations
flight_search   [  53% ] 13/50 VUs  1m11.0s/2m15.0s

running (1m12.0s), 13/50 VUs, 818 complete and 0 interrupted iterations
flight_search   [  53% ] 13/50 VUs  1m12.0s/2m15.0s

running (1m13.0s), 14/50 VUs, 844 complete and 0 interrupted iterations
flight_search   [  54% ] 14/50 VUs  1m13.0s/2m15.0s

running (1m14.0s), 14/50 VUs, 872 complete and 0 interrupted iterations
flight_search   [  55% ] 14/50 VUs  1m14.0s/2m15.0s

running (1m15.0s), 14/50 VUs, 900 complete and 0 interrupted iterations
flight_search   [  56% ] 14/50 VUs  1m15.0s/2m15.0s

running (1m16.0s), 15/50 VUs, 926 complete and 0 interrupted iterations
flight_search   [  56% ] 15/50 VUs  1m16.0s/2m15.0s

running (1m17.0s), 15/50 VUs, 956 complete and 0 interrupted iterations
flight_search   [  57% ] 15/50 VUs  1m17.0s/2m15.0s

running (1m18.0s), 15/50 VUs, 986 complete and 0 interrupted iterations
flight_search   [  58% ] 15/50 VUs  1m18.0s/2m15.0s

running (1m19.0s), 16/50 VUs, 1017 complete and 0 interrupted iterations
flight_search   [  59% ] 16/50 VUs  1m19.0s/2m15.0s

running (1m20.0s), 16/50 VUs, 1049 complete and 0 interrupted iterations
flight_search   [  59% ] 16/50 VUs  1m20.0s/2m15.0s

running (1m21.0s), 16/50 VUs, 1077 complete and 0 interrupted iterations
flight_search   [  60% ] 16/50 VUs  1m21.0s/2m15.0s

running (1m22.0s), 17/50 VUs, 1110 complete and 0 interrupted iterations
flight_search   [  61% ] 17/50 VUs  1m22.0s/2m15.0s

running (1m23.0s), 17/50 VUs, 1144 complete and 0 interrupted iterations
flight_search   [  61% ] 17/50 VUs  1m23.0s/2m15.0s

running (1m24.0s), 17/50 VUs, 1178 complete and 0 interrupted iterations
flight_search   [  62% ] 17/50 VUs  1m24.0s/2m15.0s

running (1m25.0s), 18/50 VUs, 1213 complete and 0 interrupted iterations
flight_search   [  63% ] 18/50 VUs  1m25.0s/2m15.0s

running (1m26.0s), 18/50 VUs, 1246 complete and 0 interrupted iterations
flight_search   [  64% ] 18/50 VUs  1m26.0s/2m15.0s

running (1m27.0s), 18/50 VUs, 1282 complete and 0 interrupted iterations
flight_search   [  64% ] 18/50 VUs  1m27.0s/2m15.0s

running (1m28.0s), 19/50 VUs, 1319 complete and 0 interrupted iterations
flight_search   [  65% ] 19/50 VUs  1m28.0s/2m15.0s

running (1m29.0s), 19/50 VUs, 1357 complete and 0 interrupted iterations
flight_search   [  66% ] 19/50 VUs  1m29.0s/2m15.0s

running (1m30.0s), 19/50 VUs, 1395 complete and 0 interrupted iterations
flight_search   [  67% ] 19/50 VUs  1m30.0s/2m15.0s

running (1m31.0s), 20/50 VUs, 1432 complete and 0 interrupted iterations
flight_search   [  67% ] 20/50 VUs  1m31.0s/2m15.0s

running (1m32.0s), 21/50 VUs, 1473 complete and 0 interrupted iterations
flight_search   [  68% ] 21/50 VUs  1m32.0s/2m15.0s

running (1m33.0s), 22/50 VUs, 1510 complete and 0 interrupted iterations
flight_search   [  69% ] 22/50 VUs  1m33.0s/2m15.0s

running (1m34.0s), 23/50 VUs, 1555 complete and 0 interrupted iterations
flight_search   [  70% ] 23/50 VUs  1m34.0s/2m15.0s

running (1m35.0s), 24/50 VUs, 1602 complete and 0 interrupted iterations
flight_search   [  70% ] 24/50 VUs  1m35.0s/2m15.0s

running (1m36.0s), 25/50 VUs, 1651 complete and 0 interrupted iterations
flight_search   [  71% ] 25/50 VUs  1m36.0s/2m15.0s

running (1m37.0s), 26/50 VUs, 1702 complete and 0 interrupted iterations
flight_search   [  72% ] 26/50 VUs  1m37.0s/2m15.0s

running (1m38.0s), 27/50 VUs, 1755 complete and 0 interrupted iterations
flight_search   [  73% ] 27/50 VUs  1m38.0s/2m15.0s

running (1m39.0s), 28/50 VUs, 1804 complete and 0 interrupted iterations
flight_search   [  73% ] 28/50 VUs  1m39.0s/2m15.0s

running (1m40.0s), 29/50 VUs, 1861 complete and 0 interrupted iterations
flight_search   [  74% ] 29/50 VUs  1m40.0s/2m15.0s

running (1m41.0s), 30/50 VUs, 1920 complete and 0 interrupted iterations
flight_search   [  75% ] 30/50 VUs  1m41.0s/2m15.0s

running (1m42.0s), 31/50 VUs, 1981 complete and 0 interrupted iterations
flight_search   [  76% ] 31/50 VUs  1m42.0s/2m15.0s

running (1m43.0s), 32/50 VUs, 2044 complete and 0 interrupted iterations
flight_search   [  76% ] 32/50 VUs  1m43.0s/2m15.0s

running (1m44.0s), 33/50 VUs, 2109 complete and 0 interrupted iterations
flight_search   [  77% ] 33/50 VUs  1m44.0s/2m15.0s

running (1m45.0s), 34/50 VUs, 2176 complete and 0 interrupted iterations
flight_search   [  78% ] 34/50 VUs  1m45.0s/2m15.0s

running (1m46.0s), 35/50 VUs, 2245 complete and 0 interrupted iterations
flight_search   [  79% ] 35/50 VUs  1m46.0s/2m15.0s

running (1m47.0s), 36/50 VUs, 2312 complete and 0 interrupted iterations
flight_search   [  79% ] 36/50 VUs  1m47.0s/2m15.0s

running (1m48.0s), 37/50 VUs, 2384 complete and 0 interrupted iterations
flight_search   [  80% ] 37/50 VUs  1m48.0s/2m15.0s

running (1m49.0s), 38/50 VUs, 2459 complete and 0 interrupted iterations
flight_search   [  81% ] 38/50 VUs  1m49.0s/2m15.0s

running (1m50.0s), 39/50 VUs, 2536 complete and 0 interrupted iterations
flight_search   [  81% ] 39/50 VUs  1m50.0s/2m15.0s

running (1m51.0s), 40/50 VUs, 2607 complete and 0 interrupted iterations
flight_search   [  82% ] 40/50 VUs  1m51.0s/2m15.0s

running (1m52.0s), 41/50 VUs, 2685 complete and 0 interrupted iterations
flight_search   [  83% ] 41/50 VUs  1m52.0s/2m15.0s

running (1m53.0s), 42/50 VUs, 2768 complete and 0 interrupted iterations
flight_search   [  84% ] 42/50 VUs  1m53.0s/2m15.0s

running (1m54.0s), 43/50 VUs, 2853 complete and 0 interrupted iterations
flight_search   [  84% ] 43/50 VUs  1m54.0s/2m15.0s

running (1m55.0s), 44/50 VUs, 2940 complete and 0 interrupted iterations
flight_search   [  85% ] 44/50 VUs  1m55.0s/2m15.0s

running (1m56.0s), 45/50 VUs, 3029 complete and 0 interrupted iterations
flight_search   [  86% ] 45/50 VUs  1m56.0s/2m15.0s

running (1m57.0s), 46/50 VUs, 3116 complete and 0 interrupted iterations
flight_search   [  87% ] 46/50 VUs  1m57.0s/2m15.0s

running (1m58.0s), 47/50 VUs, 3203 complete and 0 interrupted iterations
flight_search   [  87% ] 47/50 VUs  1m58.0s/2m15.0s

running (1m59.0s), 48/50 VUs, 3297 complete and 0 interrupted iterations
flight_search   [  88% ] 48/50 VUs  1m59.0s/2m15.0s

running (2m00.0s), 49/50 VUs, 3394 complete and 0 interrupted iterations
flight_search   [  89% ] 49/50 VUs  2m00.0s/2m15.0s

running (2m01.0s), 49/50 VUs, 3492 complete and 0 interrupted iterations
flight_search   [  90% ] 49/50 VUs  2m01.0s/2m15.0s

running (2m02.0s), 45/50 VUs, 3588 complete and 0 interrupted iterations
flight_search   [  90% ] 45/50 VUs  2m02.0s/2m15.0s

running (2m03.0s), 42/50 VUs, 3673 complete and 0 interrupted iterations
flight_search   [  91% ] 42/50 VUs  2m03.0s/2m15.0s

running (2m04.0s), 38/50 VUs, 3754 complete and 0 interrupted iterations
flight_search   [  92% ] 38/50 VUs  2m04.0s/2m15.0s

running (2m05.0s), 36/50 VUs, 3819 complete and 0 interrupted iterations
flight_search   [  93% ] 36/50 VUs  2m05.0s/2m15.0s

running (2m06.0s), 32/50 VUs, 3888 complete and 0 interrupted iterations
flight_search   [  93% ] 32/50 VUs  2m06.0s/2m15.0s

running (2m07.0s), 28/50 VUs, 3950 complete and 0 interrupted iterations
flight_search   [  94% ] 28/50 VUs  2m07.0s/2m15.0s

running (2m08.0s), 25/50 VUs, 4004 complete and 0 interrupted iterations
flight_search   [  95% ] 25/50 VUs  2m08.0s/2m15.0s

running (2m09.0s), 21/50 VUs, 4052 complete and 0 interrupted iterations
flight_search   [  96% ] 21/50 VUs  2m09.0s/2m15.0s

running (2m10.0s), 18/50 VUs, 4092 complete and 0 interrupted iterations
flight_search   [  96% ] 18/50 VUs  2m10.0s/2m15.0s

running (2m11.0s), 14/50 VUs, 4126 complete and 0 interrupted iterations
flight_search   [  97% ] 14/50 VUs  2m11.0s/2m15.0s

running (2m12.0s), 12/50 VUs, 4151 complete and 0 interrupted iterations
flight_search   [  98% ] 12/50 VUs  2m12.0s/2m15.0s

running (2m13.0s), 09/50 VUs, 4168 complete and 0 interrupted iterations
flight_search   [  99% ] 09/50 VUs  2m13.0s/2m15.0s

running (2m14.0s), 05/50 VUs, 4183 complete and 0 interrupted iterations
flight_search   [  99% ] 05/50 VUs  2m14.0s/2m15.0s

running (2m15.0s), 01/50 VUs, 4191 complete and 0 interrupted iterations
flight_search   [ 100% ] 01/50 VUs  2m15.0s/2m15.0s


  █ THRESHOLDS

    http_req_failed
    ✓ 'rate==0' rate=0.00%


  █ TOTAL RESULTS

    checks_total.......: 8384    62.068691/s
    checks_succeeded...: 100.00% 8384 out of 8384
    checks_failed......: 0.00%   0 out of 8384

    ✓ status is 200
    ✓ body is success

    HTTP
    http_req_duration..............: avg=12.23ms  min=5.74ms   med=11.49ms  max=53.22ms  p(90)=15.94ms  p(95)=18.1ms
      { expected_response:true }...: avg=12.23ms  min=5.74ms   med=11.49ms  max=53.22ms  p(90)=15.94ms  p(95)=18.1ms
    http_req_failed................: 0.00%  0 out of 4192
    http_reqs......................: 4192   31.034345/s

    EXECUTION
    iteration_duration.............: avg=512.75ms min=506.42ms med=512.01ms max=553.37ms p(90)=516.58ms p(95)=518.65ms
    iterations.....................: 4192   31.034345/s
    vus............................: 1      min=1         max=49
    vus_max........................: 50     min=50        max=50

    NETWORK
    data_received..................: 3.7 MB 27 kB/s
    data_sent......................: 595 kB 4.4 kB/s



running (2m15.1s), 00/50 VUs, 4192 complete and 0 interrupted iterations
flight_search ✓ [ 100% ] 00/50 VUs  2m15s